## Bootcamp | Project 2.7 | Pandas

In [1]:
import numpy as np
import pandas as pd
import array as arr
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv(r'C:\Users\seray.erol\Desktop\Python Projects\datasets\train.csv', index_col=0)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [4]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df[['Sex','Age']]

                Sex   Age
PassengerId
1              male  22.0
2            female  38.0
3            female  26.0
4            female  35.0
5              male  35.0
...             ...   ...
887            male  27.0
888          female  19.0
889          female   NaN
890            male  26.0
891            male  32.0

[891 rows x 2 columns]

In [6]:
df.groupby('Sex').mean()['Age']

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [7]:
df.groupby('Sex').mean()['Survived']

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [8]:
df[df['Age']<30].mean()['Survived']

0.40625

In [10]:
import pandas as pd
fibo = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
asal = [2, 3, 5, 7, 9, 11, 13, 15, 17, 19]
harfler = ['a','b','c','d','e','f','g','h','i','j']
df2=pd.DataFrame({'asal':asal,'fibonacci':fibo},index=harfler)
df2

   asal  fibonacci
a     2          1
b     3          1
c     5          2
d     7          3
e     9          5
f    11          8
g    13         13
h    15         21
i    17         34
j    19         55